/**
 * Created by bjwsl-001 on 2016/11/16.
 */
//解构: 同时给多个变量赋值的简化写法
//1. 使用数组下标匹配变量并赋值
  //强调: 等号左边将多个变量名放在数组中
       //等号右边将要赋的值放在数组中
       //自动获得等号右边数组的值，赋值给等号左边相同下标位置的变量
       //左边数组中每个变量都可单独使用
var [a,b,c]=[1,2,3];
console.log(a,b,c);
//2. 用对象的属性同时对多个变量赋值
  //等号左边: 将变量放在对象的属性值上
  //等号右边: 将变量的值放在和左边对象相同的属性中作为值
  //匹配时: 将右边对象中相同的属性名的值赋值给等号左边相同属性名的变量中
var {m:month,y:year,d:date}={d:16,y:2016,m:11};
console.log(month,year,date);
//3. 作为函数的参数传入:
function g({name:x,age:y}){
  console.log(x,y);
}
var lilei={name:"Li Lei",age:13};
g(lilei);